import React from 'react';

const About: React.FC = () => {
  return (
    <>
      <h2>Пилот Формулы-1</h2>
      <div className='d-flex'>
        <div className="col-10 ms-3 fl">
          <img className='float-start me-4' src='https://f1flow.ru/upload/iblock/409/2aj15ad3sqzmiw40mv9dty716hdh07hw.jpg' alt='#'/>
          <span>Сэр Лью́ис Карл Дэ́видсон Хэ́милтон MBE — британский автогонщик команды Формулы-1 «Мерседес». Семикратный чемпион мира. Хэмилтон — первый в истории гонщик Формулы-1, одержавший 100 побед. В 2020 году он также повторил рекорд Михаэля Шумахера, выиграв 7 чемпионских титулов. Хэмилтон родился в Стивенидже, Хартфордшир. </span>
          <ul className="list-group mt-3">
            <li className="list-group-item">Дата и место рождения: 7 января 1985 г. (возраст 39 лет), Стивенидж,
              Великобритания
            </li>
            <li className="list-group-item">Текущая команда: Мерседес</li>
            <li className="list-group-item">Книги: Lewis Hamilton: My Story</li>
            <li className="list-group-item">Родители: Кармен Локхарт, Энтони Гамильтон</li>
            <li className="list-group-item">Рост: 1,74 м</li>
            <li className="list-group-item">Братья и сестры: Николас Хэмилтон, Никола Локхарт, Саманта Локхарт</li>
            <li className="list-group-item">Победы: 103</li>
          </ul>
          <p className='mt-3'>Мать Хэмилтона, Кармен Ларбалестир (сейчас Кармен Локхарт), белая англичанка.[14]
            Отец, Энтони Хэмилтон, — сын чернокожего эмигранта из Гренады[15]. Родители дали имя Льюису в честь американского легкоатлета Карла Льюиса, выигравшего три золота на чемпионате мира 1983 года и четыре золота на Олимпийских играх 1984 года[15][16].
            Родители Хэмилтона развелись, когда ему было 2 года, и он жил со своей матерью и сводными сёстрами Николой и Самантой[17] до того момента, как ему исполнилось двенадцать, когда он начал жить со своим отцом, мачехой Линдой и единокровным братом Николасом  (англ.)рус.,[15] который болен ДЦП.[18] В начале 2011 года Николас подписал контракт с командой «Total Control Racing», тем самым начав свою гоночную карьеру в британском кубке Рено Клио  (англ.)рус..
            Интерес Хэмилтона к гонкам начал проявляться после участия в гонках радиоуправляемых машин. Его отец Энтони купил ему одну в 1991 году и Хэмилтон финишировал вторым в чемпионате BRCA  (англ.)рус. на следующий год. В то время Хэмилтон говорил: «Я участвовал в гонках радиоуправляемых машин и выиграл чемпионат против взрослых».[19] Это привело Хэмилтона в картинг. Когда ему исполнилось шесть, его отец купил ему первый карт в качестве рождественского подарка[20] сказав ему, чтобы он поддерживал свою гоночную форму, в то время как он упорно учился в школе. Когда поддержка сына стала проблематичной, его отец уволился с должности IT-менеджера и стал подрядчиком, временами работая на трёх работах, чтобы поддержать карьеру сына и до сих пор находил достаточное время, чтобы присутствовать на всех гонках Льюиса. Позже он создал
            свою компьютерную компанию и работал в качестве менеджера Льюиса на постоянной основе.[15][21]
            Хэмилтон обучался в католической школе The John Henry Newman School
            (англ.)рус., в Стивенидже, Хартфордшир[15][22]. Он улучшил свои футбольные навыки, и
            грая в школьной команде с будущим полузащитником сборной Англии по футболу Эшли Янгом[21].
            Хэмилтон говорил, что если бы не Формула-1, он бы стал футболистом или игроком в крикет, которым
            он также занимался, учась в школе.[15][23] В феврале 2001 года Хэмилтон начал обучаться в «Cambridge
            Arts and Sciences» (CATS), частном «колледже шестого класса».[15] В пять лет начал заниматься каратэ,
            чтобы защищать себя от издевательств в школе.[15] Примерно в 12 лет, он научился ездить на одноколёсном
            велосипеде.[24] </p>
        </div>
      </div>
    </>
  );
};

export default About;